{
  "employmentHistory": [
    {
      "company": "Slice.trade",
      "startDate": "March 2024",
      "endDate": "August 2024",
      "position": "Fullstack Developer",
      "technologies": ["TypeScript", "React.js", "Next.js", "Node.js"],
      "description": "Contributed from the beginning to the successful launch of a cryptocurrency trading application that pioneered the concept of a coin functioning as an index fund, backed by underlying assets in the form of other coins. Collaborated within a small development team of three members, primarily responsible for frontend development and data retrieval from both smart contracts and internally developed APIs. The contract ended in August 2024 due to insufficient funding and challenges in securing new investors. Interested? Feel free to send me a message, and I’ll be happy to inform the founders!"
    },
    {
      "company": "Prisjakt",
      "startDate": "May 2022",
      "endDate": "March 2024",
      "position": "Fullstack Developer",
      "technologies": ["TypeScript", "React.js", "Next.js", "Node.js"],
      "description": "Prisjakt.se or PriceSpy.co.uk is a comparison app to help consumers find the best deal on a product. Placed as a fullstack developer in a team that focused on the web app, creating new features and improving SEO on all pages. The site went from 32,000 to 51,000 sessions thanks to my team’s dedicated SEO efforts. I also created new admin services and made significant technical and optimization improvements to the site, including Next.js and TanStack. I assumed the scrum-master role after a few months. My latest project involved creating a head for the headless CMS Sanity.io and rewriting our frontend using Next.js. A continuous part of my job was creating interactive designs from Figma sketches."
    },
    {
      "company": "Boole Capital",
      "startDate": "March 2023",
      "endDate": "April 2023",
      "position": "Software Engineer",
      "technologies": ["Node.js"],
      "description": "Optimized and debugged dependencies and trading algorithms for a Basis Arbitrage crypto trading engine. Set up AWS with VPN proxy to securely host the server connection with the lowest latency. The trading engine is currently operational and profitable, managing around $10 million worth of assets."
    },
    {
      "company": "Jabra, GN Audio",
      "startDate": "December 2020",
      "endDate": "May 2022",
      "position": "Fullstack Developer",
      "technologies": ["JavaScript", "C#", "TypeScript", "Angular"],
      "description": "As a JavaScript developer, I created solutions for integrating third-party products. Projects included: 1) A JavaScript application to make Amazon Connect Softphone integratable with Jabra headsets. 2) A JavaScript-Salesforce app to show users real-time updates and statistics during ongoing calls. 3) Rewriting the desktop app into a web app and adding new features such as device management for Jabra devices in offices."
    },
    {
      "company": "Hejmo Kredit AB",
      "startDate": "August 2018",
      "endDate": "December 2020",
      "position": "Fullstack Developer",
      "technologies": ["Kotlin", "JavaScript", "Vue.js"],
      "description": "Transitioned to Hejmo, a sister company of Kollektiva, where I focused on developing the mortgage loan app, enabling Swedish citizens to transfer their loans from big banks to Hejmo for a lower interest rate. I was involved in the entire product lifecycle and took on the role of scrum-master during my final year, working within an agile development team of 7 members."
    },
    {
      "company": "Kollektiva jämförelser i Sverige",
      "startDate": "June 2017",
      "endDate": "August 2018",
      "position": "Fullstack Developer",
      "technologies": ["Java", "JavaScript", "Vue.js"],
      "description": "In my initial junior role as a fullstack developer at Kollektiva, I contributed to developing a web application with a user base of over 35,000. This platform used crowd intelligence to help Swedish citizens manage their pension savings. I worked in an agile development environment with a team of five members."
    }
  ],
  "skills": [
    "JavaScript (React, React Query, Vue.js, Next.js, Angular)",
    "TypeScript",
    "HTML",
    "CSS (Tailwind, Styled Components)",
    "Jest",
    "Cypress",
    "GraphQL",
    "Node.js (Express, Websockets.io)",
    "Kotlin",
    "Java",
    "C#",
    "Git",
    "Github/GitLab",
    "Google Cloud Platform",
    "AWS (S3, Route 5)",
    "Google Analytics 4",
    "Google Tag Manager",
    "MongoDB",
    "MySQL",
    "OAuth",
    "Web APIs (Prismic, Contentful, Sanity)",
    "Microservices Architecture",
    "Blockchain (EthersJS, Wagmi)"
  ],
  "volunteerProjects": [
    {
      "organization": "Pink Programming",
      "role": "Tutor",
      "description": "Tutor at the Swedish non-profit organization Pink Programming, aiming to get girls and women more interested in tech. Held workshops in JavaScript and Git, and provided overall tutoring."
    },
    {
      "organization": "Alloliance",
      "role": "Frontend Developer",
      "description": "Implemented the frontend for a web3 compliance protocol, powered by Allo Protocol's stack, streamlining KYC submissions and approvals for grant seekers."
    }
  ]
}
